package tests

import "time"

// RelativeDate возвращает дату в будущем по прошествии указанных дней и часов.
// Это позволяет запускать тесты параллельно, так как каждый тест использует разные дату и час.
//
// Недостатком этого подхода является то, что вам нужно знать об используемых датах при добавлении нового теста.
// В нашем случае это не проблема, так как обнаружить все места использования тривиально, а их всего несколько.
//
// Другой, более сложный подход — использовать случайные даты и повторять попытку в случае ошибки.
func RelativeDate(days int, hour int) time.Time {
	now := time.Now().UTC().AddDate(0, 0, days)
	return time.Date(now.Year(), now.Month(), now.Day(), hour, 0, 0, 0, time.UTC)
}
